// 2d_array.c
// 二维数组的使用
#include <stdio.h>

int main() {

    // 数组定义和初始化
    // 按行连续方式缺省行数，无需给出所有元素初始值，只需给出（行数-1）*列数+1个初始值
    int a[][3] = { 1,2,3,4,5,6,7 };

    // 更改数组元素
    a[0][0] = 0;

    // 查看数组元素
    for (int i = 0; i < 3; i++) {
        for (int j = 0; j < 3; j++) {
            printf("a[%d][%d] = %d\n", i, j, a[i][j]);
        }
    }

    return 0;
 
}
// 输出
// a[0][0] = 0
// a[0][1] = 2
// a[0][2] = 3
// a[1][0] = 4
// a[1][1] = 5
// a[1][2] = 6
// a[2][0] = 7
// a[2][1] = 0
// a[2][2] = 0