// bitwise_operators.c
// C语言位运算符的使用
#include <stdio.h> 

int main()
{
    // a的补码表示：0000 0000 0000 0000 0000 0000 0001 1001
    // b的补码表示：0000 0000 0000 0000 0000 0000 0000 0101
    int a = 25, b = 5;

    // a&b的补码表示：0000 0000 0000 0000 0000 0000 0000 0001
    printf("a & b: %d\n", a & b);
    // a|b的补码表示：0000 0000 0000 0000 0000 0000 0001 1101
    printf("a | b: %d\n", a | b);
    // a^b的补码表示：0000 0000 0000 0000 0000 0000 0001 1100
    printf("a ^ b: %d\n", a ^ b);
    // ~a的补码表示：1111 1111 1111 1111 1111 1111 1110 0110
    printf("~a: %d\n", ~a);
    // a>>b的补码表示：0000 0000 0000 0000 0000 0000 0000 0000
    printf("a >> b: %d\n", a >> b);
    // a<<b的补码表示：0000 0000 0000 0000 0000 0011 0010 0000
    printf("a << b: %d", a << b);

    return 0;

}
// 输出
// a & b: 1
// a | b : 29
// a ^ b : 28
// ~a: -26
// a >> b : 0
// a << b : 800

// 移位运算符<<和>>根据左操作数的不同，补位的数有可能不同（有符号数的负值右移会补1）
// 不溢出的情况下，左移1位和右移1位都能实现数值除2或者乘2的效果